-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jun 24, 2025 at 12:47 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `bookstore`
--

-- --------------------------------------------------------

--
-- Table structure for table `books`
--

CREATE TABLE `books` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `author` varchar(100) NOT NULL,
  `description` text NOT NULL,
  `cover_image` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `books`
--

INSERT INTO `books` (`id`, `title`, `author`, `description`, `cover_image`, `created_at`) VALUES
(1, 'کتابخانه نیمه شب', 'مت هیگ', 'کتاب کتابخانه نیمه شب رمانی فانتزی است که به اهمیت استفاده از فرصت‌های زندگی و قدردانی از داشته‌ها می‌پردازد. نورا، شخصیت اصلی رمان، در سیاهی مطلق به سر می‌برد، در یک شکست تمام و کمال. او همه‌چیزش را از دست داده است؛ در علائقش مثل شنای حرفه‌ای، یخچال‌شناسی، موسیقی و تحصیل در رشته‌ی فلسفه شکست خورده است، دو ماه مانده به ازدواجش مادرش را بر اثر سرطان از دست داده و نامزدی‌اش را برهم زده است و گربه‌ی عزیزش هم جان می‌دهد.\n\nهمه‌ی این تاریکی‌ها باعث می‌شود نورا تصمیم بگیرد جهان را ترک کند ولی قبل از عملی کردن تصمیمش با اتفاق عجیبی مواجه می‌شود؛ او شب چند عدد از قرص‌های ضدافسردگی‌اش را می‌خورد ولی ناگهان نیمه‌شب بیدار می‌شود و به ساختمان کتابخانه‌ای می‌رود. کتابدار که شبیه کتابدار دبیرستان نورا است، به او می‌گوید کتاب‌های این کتاب زندگی‌هایی هستند که او می‌توانست داشته باشد. زن از نورا می‌خواهد یک زندگی را انتخاب کند و در آن بماند. نورا به ترتیب کتاب‌ها را می‌خواند؛ در یکی با نامزدش ازدواج کرده، در دیگری یخچال‌شناس شده و به قطب رفته و به همین ترتیب پیش می‌رود تا این‌که بالاخره در یک زندگی می‌ماند؛ در زندگی‌ای که به او فرصت می‌دهد از اول بسازد و مسیر دیگری را در پیش بگیرد.\n\nناشر: کتاب کوله‌پشتی', '/images/book1.jpg', '2025-06-24 09:46:21'),
(2, 'ملت عشق', 'الیف شافاک', 'این کتاب با داستان زندگی اللا روبینشتاین شروع می‌شود. اللا سال‌ها بود عادت‌ها، نیازها و سلیقه‌هایش تغییر نکرده بود. روزها روی خطی مستقیم پیش می‌رفت؛ یکنواخت و منظم و عادی. بخصوص در بیست سال اخیر زندگی‌اش را جزء به جزء با توجه به زندگی زناشویی‌اش تنظیم کرده بود. همهٔ آرزوهایش، همهٔ دوستان جدیدش، حتی کوچک‌ترین تصمیم‌هایش هم به این وابسته بود. تنها قطب‌نمایی که سمت و سوی زندگی‌اش را تعیین می‌کرد خانه و خانواده‌اش بود. شوهرش دیوید دندان‌پزشک مشهوری بود؛ مردی فوق‌العاده موفق در کارش، با درآمد بالا. اما پیوندشان چندان عمیق نبود. کمی بعد از اینکه اللا متوجه خیانت همسرش شد و حال خوبی نداشت شوهرش موضعش را تغییر داد و از او خواست کار کند. اللا به امید تغییر زندگی به‌دنبال کار گشت و در جایگاه دستیار ویراستار یک انتشارات مشهور شروع به‌کار کرد. زمانی که دخترش به او می‌گوید می‌خواهد با مردی که دوستش دارد ازدواج کند بحثی در خانه آن‌ها شکل می‌گیرد که اللا در آن متهم می‌شود هیچ‌چیز از عشق نمی‌فهمد. در همین زمان انتشارات از او می‌خواهد کتابی درباره مولوی شاعر قرن هفتم را ویرایش کند و همین موضوع زندگی اللا را تغییر می‌دهد و او در ۴۰ سالگی‌اش درخواست طلاق می‌دهد.\n\nناشر: گروه انتشاراتی ققنوس', '/images/book2.png', '2025-06-24 09:46:21'),
(3, 'غرور و تعصب', 'جین آستین', 'غرور و تعصب داستانی واقع‌گرایانه‌ی عاشقانه است که شرایط اجتماعی انگلستان در قرن نوزدهم را به تصویر می‌کشد. در این جامعه که به‌شدت درگیر نظام طبقاتی است، کلیشه‌هایی مثل غرور طبقه‌ی اشراف یا تعصب به باورهایشان رایج است. ازدواج، دادوستدی است که با آن اعتبار به دست می‌آید و آبرو حفظ می‌شود. زنان به عقب رانده شده‌اند و تنها موفقیت آن‌ها احتمالاً ازدواج با مردی ثروتمند یا قدرتمند است. آستین در این کلاسیک عاشقانه، جایگاه و نقش زنان در خانواده و جامعه‌ی آن روزهای انگلستان را به‌خوبی روایت کرده است.\n\nناشر: نشر نی', '/images/book3.jpg', '2025-06-24 09:46:21'),
(4, 'جزء از کل', 'استیو تولتز', 'تولتز در این کتاب خانواده عجیب دین را به شما معرفی می‌کند خانواده‌ای که با هم و با اطرافیان خود روابط خاصی دارند. جسپر دین پسر مارتین داستان را روایت می‌کند. محور داستان رابطه بین جسپر و پدرش است؛ پدری باذکاوت و فیلسوف‌مآب که سعی دارد نظرات و عقایدش را به پسر منتقل کند؛ اما جسپر همیشه از تحمیل عقاید پدرش فراری بوده است. او نمی‌خواهد شبیه پدر شود و فکر می‌کند به دلیل تربیت عجیب پدر و زخم‌زبان‌هایش کودکی جالبی را نگذرانده است، او سعی می‌کند دور از پدرش زندگی و کار کند، کمی بعد، تری عموی جسپر هم که مردی خوش‌چهره، ورزشکار و خوشرو اما با یک اشتباه بزرگ در زندگی است، وارد داستان می‌شود و کش و قوس روابط جسپر با پدر و حالا عمویش، بالا می‌گیرد.\n\nتولتز خود می‌گوید کتاب جزء از کل را درباره ترس از مرگ نوشته است. این اثر درواقع کاوشی در اعماق روح انسان است رمانی پست‌مدرن با طنزی سیاه و جذاب که شما را به دنیای یخ‌زده خود می‌کشاند اما به ذهن و روحتان گرما می‌بخشد.\n\nناشر: نشر چشمه', '/images/book4.jpg', '2025-06-24 09:46:21'),
(5, 'سایه باد', 'کارلوس روئیت ثافون', 'داستان در شهر بارسلون اتفاق می‌افتد. پسربچه‌ای ۱۰ ساله با پدرش در یک روز سرد به گورستانی از کتاب‌های فراموش شده در شهر قدیم بارسلون می‌رود. کتابخانه‌ای با دالان‌های تودرتو و عنوان‌های مرموز و از یاد رفته. پسر اجازه دارد که یک کتاب را انتخاب کند و بردارد. او از میان قفسه‌های خاک‌آلود و وحشت‌انگیز، کتاب سایه‌ی باد نوشته خولیان کاراکس را برمی دارد. پسر بزرگ می‌شود و افرادی به دلایلی نامعلوم و وحشت‌انگیز به کتاب او علاقه شدیدی نشان می‌دهند و از این جاست که ماجراهای پرتعلیق سایه‌ی باد آغاز می‌شود.\n\nناشر: نشر نیماژ', '/images/book5.jpg', '2025-06-24 09:46:21'),
(6, 'دوست باهوش من', 'النا فرانته', 'النا فرانته نویسنده‌ مشهوری در دنیاست. موفقیت چشمگیر «دوست باهوش من» در صنعت نشر، رویدادی بی‌همتا محسوب می‌شود و غیرممکن می‌توان آن را در ادبیات داستانی معاصر ایتالیا نادیده گرفت.\n\nلی‌لا و لنو دوستان صمیمی‌ای هستند که از سال‌های کودکی و دوران مدرسه باهم دوست بودند. بعد از جنگ جهانی دوم شرایط تحصیل این ۲ نوجوان در ایتالیا بسیار تغییر می‌کند و لی‌لا مدرسه را رها می‌کند تا در مغازه کفاشی خانوادگی‌شان کار کند. لنو درس‌خواندن را ادامه می‌دهد و با حمایت معلمش موفق می‌شود. رابطه این ۲ دوست تا میان‌سالی در این کتاب دنبال می‌شود. اما این دوستی با چالش بحران هویت درگیر اتفاقات سختی می‌شود.\n\nناشر: نشر ثالث', '/images/book6.jpg', '2025-06-24 09:46:21'),
(7, 'خاطرات یک گیشا', 'آرتور گلدن', 'خاطرات یک گیشا روایتی از خاطرات زندگی زنی گیشا به نام نیتا سایوری و دیدگاه و تجربیات او از حرفه گیشاگری در برخورد با مردم و خود زندگی است.\n\nاما آنچه آرتور گلدن، نویسندهٔ آمریکایی این کتاب در سیر داستان به ما نشان می‌دهد، چیزی فراتر از فقط یک زندگی‌نامه است. درواقع در طی این داستان ما با فرهنگ و شیوهٔ زندگی گیشاهای ژاپنی که در طول زمان گزارش‌ها و شایعات گوناگونی درباره‌شان شنیده‌ایم آشنا می‌شویم. از نوع زندگی گیشاهای ژاپنی مطلع می‌شویم که آداب و رسوم دیرینه خشک و انعطاف‌ناپذیر، همراه با انضباط شبه نظامی حاکم بر زندگی شخصی و اجتماعی‌شان از آنان چهره‌ای مرموز و ناشناخته ساخته است.\n\nآنچه ما را به نگاشتن این پیشگفتار وا داشت، دیدگاه نادرست اغلب خارجیانی است که گیشاها را به نوعی زنان روسپی می‌انگارند. چنین نیست. در همین کتاب، در مواردی چند به قولی از راوی داستان برمی‌خوریم که با اشاره به داستان زندگی گیشایی دیگر نقل می‌کند که در نهایت کارش به تن‌فروشی کشید و آن را مایهٔ سرافکندگی، شرمساری و کسر شأن یک گیشای واقعی می‌داند.\n\nاین کتاب روایت زن هزازان زنی است که در فرهنگ برداره‌داری گیشا زندگی‌شان نابود می‌شود.\n\nناشر: انتشارات سخن', '/images/book7.jpg', '2025-06-24 09:46:21'),
(8, 'لانه گریورها', 'جیمز دشنر', 'کتاب لانه گریورها دربردارندهٔ رمانی علمی - تخیلی برای نوجوانان است که نخستین‌بار در سال ۲۰۰۹ میلادی انتشار یافت. داستان چیست؟ زمانی که «توماس» در یک آسانسور به هوش می‌آید، تنها چیزی که می‌تواند به خاطر آورد، نامش است. او را پسرهای غریبه‌ای احاطه کرده‌اند که مانند او حافظه‌شان را از دست داده‌اند. در پشت دیوارهای سنگی اطراف آن‌ها، هزارتوی بیکرانی وجود دارد که مدام در حال تغییر است. این هزارتو تنها راه خروج از این مکان به حساب می‌آید و تابه‌حال هیچکس زنده از آن رد نشده است. با پیشروی داستان، دختری با پیامی وحشتناک از راه می‌رسد. او می‌گوید «به خاطر بیار، زنده بمان و فرار کن». رمان حاضر ۶۲ فصل دارد و جزو مجموعه‌ای است که در فهرست برترین رمان‌های ادبیات نوجوان و از پرفروش‌های نیویورک تایمز بوده و فیلمی بر اساس آن در سال ۲۰۱۴ میلادی ساخته شده است.\n\nناشر: نشر افق', '/images/book8.webp', '2025-06-24 09:46:21'),
(9, 'کوه پنجم', 'پائولو کوئیلو', 'پائولو کوئلیو ( - ۱۹۴۷)، نویسنده معاصر برزیلی است. رمان‌های او بین عامه مردم در کشورهای مختلف دنیا پرطرفدار است. «کوه پنجم» داستان سفر روحانی ایلیای نبی است. در هرج و مرج سده‌ نهم پیش از میلاد، ایزابل، شاهدخت فینیقی و همسر پادشاه اسرائیل، دستور اعدام تمام انبیای بنی‌اسرائیل را صادر می‌کند که حاضر به پرستش خدای بعل نیستند. ایلیای ۲۳ ساله به دستور فرشته‌ خدا، از اسرائیل می‌گریزد و در شهر کوچکی به نام صرفه در لبنان پناه می‌گیرد و در آنجا زنی بیوه، عشق و زندگی خود را نثار او می‌کند و این عشق تمام هستی ایلیا را در بر می‌گیرد. اما او برگزیده شده است تا در آزمون تکان دهنده‌ ایمان، بر ناکامی‌های خویش غلبه کند. داستان ایلیا، داستان مقاومت و امید است و سفری که هرگز از یاد نخواهد رفت. «کوه پنجم» ادعا می‌کند که نباید فاجعه را یک مجازات دانست، فاجعه‌ مبارزه‌ای است که پیش روی هر انسان قرار می‌گیرد. این داستان از گذشته بر می‌خیزد، اما مضمون آن هرگز کهنه نخواهد شد. «کوه پنجم» سرشار از پرسش‌های مخلوق از خالق خویش است و به ما می آموزد که چگونه ایمان و عشق می‌توانند بر درد و رنج غلبه کنند.\n\nناشر: نشر ثالث', '/images/book9.jpg', '2025-06-24 09:46:21'),
(10, 'فرانکنشتاین', 'مری شلی', 'دکتر فرانکشتاین مرد خودخواه و بسیار باهوشی است. او می‌تواند راهی پیدا کند که با استفاده از نیروی برق صاعقه به اجساد مردگان دوباره جان دهد. او برای رسیدن به یک مخلوق به قبرستان می‌رود و تکه‌های اجساد مردگانی که هنوز نپوسیده‌اند را به آزمایشگاهش می‌آورد و آنها را به هم می‌دوزد.\n\nیک شب بارانی ترکیب این اجساد زنده می‌شود. اما کمی بعد متوجه می‌شود موجودی که ساخته است بسیار ترسناک و خالی از زیبایی‌ و ظرافت است. دکتر با بی‌محبتی و رفتار بد موجود را از خانه‌اش فراری می‌دهد. داستان دو بخش دارد اول نگاه خود دکتر فرانکنشتاین به کاری است که کرده دوم نگاه هیولای فرانکشتاین به زندگی و غم و تنهایی‌ای که احساس می‌کند.\n\nناشر: گروه انتشاراتی ققنوس', '/images/book10.jpg', '2025-06-24 09:46:21'),
(11, 'آخرین چیزی که به من گفت', 'لارا دیو', 'کتاب آخرین چیزی که به من گفت اثر لارا دیو، یک کتاب معمایی جزء پرفروش‌های نیویورک تایمز و انتخاب باشگاه کتاب ریس ویترسپون است که بیش از دو میلیون خواننده را مجذوب خود کرده است. این رمان درباره‌ی زنی است که به دنبال حقیقت ناپدید شدن شوهرش است، آن هم به هر قیمتی.\n\nمجله‌ی ریل سیمپل این کتاب را یک تریلر جذاب و صمیمانه درباره‌ی فداکاری‌هایی که برای افرادی که بیشتر دوستشان داریم انجام می‌دهیم عنوان کرده است.\n\nدر کتاب آخرین چیزی که به من گفت پیش از ناپدید شدن اوون مایکلز، او پنهانی یادداشتی را به همسر محبوبش می‌دهد که در آن نوشته «از او محافظت کن». هانا هال علی‌رغم سردرگمی و ترسش، دقیقا می‌داند که این یادداشت به چه کسی اشاره دارد: دختر شانزده‌ی ساله اوون، بیلی. بیلی که در کودکی مادرش را به طرز غم‌انگیزی از دست داده و مطلقا نمی‌خواهد با نامادری جدیدش کاری داشته باشد.\n\nاز آن‌جا که تماس‌های ناامیدانه هانا با اوون بی‌پاسخ می‌ماند، زمانی که FBI رئیس اوون را دستگیر می‌کند، در حالی که یک مارشال ایالات متحده و ماموران فدرال بدون اعلام قبلی به خانه‌ی او می‌رسند، هانا به سرعت متوجه می‌شود که شوهرش اصلا آن کسی نیست که وانمود کرده است، و این که بیلی ممکن است کلید کشف هویت واقعی اوون و دلیل ناپدید شدن او را در دست داشته باشد.\n\nهانا و بیلی به دنبال کشف حقیقت هستند، اما همان‌طور که آن‌ها شروع به کنار هم قرار دادن قطعات گذشته‌ی اوون می‌کنند، به زودی متوجه می‌شوند که در حال ساختن آینده‌ی جدیدی هستند، آینده‌ای که هیچ‌یک از آن‌ها نمی‌توانستند پیش‌بینی کنند.\n\nهانا هال همسر اوون و همچنین قهرمان و راوی داستان است. او ۳۸ سال دارد و یک چوب‌تراش حرفه‌ای است، اما حرفه‌اش را بیشتر به عنوان «مجسمه‌سازی» توصیف می‌کند. پدربزرگش نیز چوب‌تراش بود و هانا نیز به همین دلیل به این حرفه علاقه‌مند شد. او تقریبا به طور کامل توسط پدربزرگش بزرگ شد. همانظور که خودش می‌گوید، او تا آنجایی که به خاطر می‌آورد، در مرکز زندگی‌اش بوده است. پدر و مادر هانا هرگز علاقه‌ی زیادی به تربیت او نداشتند؛ پدرش ۲۸۰ روز در سال سفر می‌کرد و بقیه‌ی وقت خود را در مزرعه‌ی خانواده‌اش در تنسی می‌گذراند.\n\nناشر: نشر نون', '/images/book11.jpg', '2025-06-24 09:46:21');

-- --------------------------------------------------------

--
-- Table structure for table `favorites`
--

CREATE TABLE `favorites` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `book_id` int(11) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(255) NOT NULL,
  `email` varchar(100) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `password_hash` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `email`, `created_at`, `password_hash`) VALUES
(1, 'testuser', '', 'test@example.com', '2025-06-24 10:46:13', '$2y$10$...hashed_password...');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `favorites`
--
ALTER TABLE `favorites`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_user` (`user_id`),
  ADD KEY `fk_book` (`book_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `books`
--
ALTER TABLE `books`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `favorites`
--
ALTER TABLE `favorites`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `favorites`
--
ALTER TABLE `favorites`
  ADD CONSTRAINT `fk_book` FOREIGN KEY (`book_id`) REFERENCES `books` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk_user` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
